Revit 2026 API

# PrintManagerCombinedFile Property

---

Indicates whether to combine multiple selected views/sheets into a single file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CombinedFile { get; set; }
```
```vb
Public Property CombinedFile As Boolean
	Get
	Set
```
```cpp
public:
property bool CombinedFile {
	bool get ();
	void set (bool value);
}
```
```fsharp
member CombinedFile : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current printer is not a virtual printer. |

The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace